用語　語句違い
用語　特定のジャンルの語句
語句　１まとまりの言葉

ハードウェア
ソフトウェア（OS（人間の魂）つまりないと死ぬ
OS関連（もとから入っているデバイスドライバなどのソフトウェア
それ以外（アプリケーションソフトウェア）
アプリケーション（
 ネイティブアプリ(googleplayなどからダウンロードするアプリ)
 WEBアプリ（ダウンロードいらずブラウザ上でやるアプリ）
 デスクトップアプリ（wordなどインターネットにつながなくてもいいアプリ）
｝
インフラ　オンプレミス（自前でサーバーなどを構築する）
クラウド（期間ごとにアクセス数変化し巨大なサーバー借りるのもったいないときに便利）
S(subete)aaS(AP,OS,server,network)
P(A（P）以外)aaS(AP以外用意してくれる)
l(least)aaS(AP,OS以外用意してくれる)
DBserverのことをミドルウェアと呼ぶこともある
WEBアプリ（ダウンロードいらずブラウザ上でやるアプリ）
[ミドルウェア]APとOSの中間
「API」別のプログラムからプログラムの機能を使うための窓口
リクエスト来たら昨日送る
「SRE」サービスの信頼性や向上製を上げる。サービスを自動化する

「フロントエンド」WEBブラウザ
「バックエンド」WEBサーバー、APサーバー、DBサーバー

「フルスタックエンジニア」設計から開発から保守までする
[モバイルエンジニア]iosエンジニアとandroidエンジニアの総称
[機械学習エンジニア]機械学習を用いて開発する
「データサイエンティスト」データを分析してサービスの課題を提案する
機械学習エンジニア　機械学習中心　データサイエンティスト　統計分析中心


「エンジニアリングマネージャー」エンジニアのマネージメントする。プロジェクトなどの
「プロダクトマネージャー」プロダクトの方向性（どんな人にどのようにするかなど）を決める
「プロジェクトマネージャー」プロジェクトのスケジュールを決める
「プロダクトオーナー」プロダクトの責任者　プロダクトマネージャーのトップの人

「スクラム(チーム開発で変更しながら開発する)マスター」スクラムをうまく潤滑に行う
「テックリード（リードエンジニア）」エンジニアのじゅつつ面のリーダーでアウトプットをよくする
「CTO」会社の最高技術責任者
「ＶＰoE」エンジニア組織のマネジメント責任者で採用の評価などを担当
「アジャイル」細かい単位でリリースする
開発工程　目標設定　
要件定義　システムの必要な機能を決める
設計　インフラやDBの攻勢を決める
実装　
テスト　
デプロイ　
運用

CI（ビルドやテスト自動化）/CD(テストされたコードのマージや門番環境向けのビルドの作成を自動的にする)